[{"Meal":"monday 1","Name":"Smoked Salmon Eggs Benedict With Lemon Dill Hollandaise","Ingredients":"1 cup baby arugula, 1 cup baby spinach, 2 tablespoons butter, 3 large egg yolks, 4 eggs, poached, 1 tablespoon fresh dill or 1 tsp. dried, 1 lemon, 2 slices thick multigrain bread, Salt and pepper to taste, 8 ounces smoked salmon, 2 tablespoons water, 1 tsp. Worcestershire sauce","Instructions":"0. Make Lemon Dill Hollandaise:Fill a medium saucepan about halfway with water, and bring to a gentle simmer over medium heat. 1. Put the egg yolks and water in a heatproof bowl, season with a pinch of dill (if using dried), salt, and pepper. 2. Whisk the ingredients together and then place the bowl on top of the saucepan. Keep stirring the egg mixture for about 5 minutes or until it begins to thicken. Make sure you dont scramble your eggs! Once the eggs are thickened, take the bowl off the water and set aside.Poach the eggs:Fill a medium saucepan with water, add a splash of white vinegar (optional, but this helps hold the whites together which results in nicely shaped eggs) and bring to a gentle simmer. You want tiny bubbles only, not a rolling boil. Gently add eggs to water and poach until deisred doneness.Meanwhile, toast bread. 3. Place toast on plates and top with arugula, spinach and salmon. 4. Place eggs on top of salmon and spoon hollandaise over the top. 5. Garnish with dill, salt and freshly cracked black pepper and serve.","Calories":"539","Carbs":"20g","Fat":"32g","Protein":"41g"},{"Meal":"monday 2","Name":"How to Make an Easy Chicken Enchilada","Ingredients":"fajita chicken fully cooked, 1\/4 cup butter, 2 Tbs sour cream, 4 oz. cream cheese, 1 bell pepper, flour tortillas, shredded cheese","Instructions":"0. Heat oven up to 35 1. In a medium-sized pan melt the butter, add the sour cream, and saute the chicken and bell pepper on medium heat for 5 minutes. 2. Once the bell peppers have softened up, add in the cream cheese and stir until all is well mixed together. 3. Use cooking spray to prepare your baking dish. Take a flour tortilla, add in the chicken and cheese sauce and roll. 4. Place in the dish and use a toothpick to keep close if needed. Continue to roll remaining chicken mixture and tortillas. Top with shredded cheese. 5. Bake for 10 minutes, or until cheese is melted. 6. Remove toothpicks before serving.","Calories":"629","Carbs":"19g","Fat":"47g","Protein":"31g"},{"Meal":"monday 3","Name":"Sheesh Kabobs with Yogurt Dip","Ingredients":"1 teaspoon of chili powder, 1\/2 teaspoon of coriander powder, 1\/2 cucumber, peeled, deseeded and chopped, 1\/2 teaspoon of cumin powder, 1 teaspoon of dill, 1 handful of fresh chopped coriander, 1 teaspoon of ginger garlic paste, 1 green pepper chopped, 1 16 oz package ground beef, 2 tablespoons of olive oil, Olive oil, pepper, Salt, 1 cup of sour cream, 1 cup of fresh yogurt","Instructions":"0. Combine all the spices and minced meal and arrange it into skewers 1. Drizzle olive oil onto a pan with aluminum foil 2. Place the skewers over itSet the oven for 400 degrees and cook for 30 minutes","Calories":"830","Carbs":"15g","Fat":"71g","Protein":"32g"},{"Meal":"tuesday 1","Name":"Pumpkin Doughnuts","Ingredients":"1 tsp baking powder, 1 cup bread flour, 1 tsp cinnamon, 2 large eggs, ½ tsp ground cinnamon, ½ tsp pumpkin pie spice, ¾ cup pumpkin puree, ½ tsp salt, ½ cup sugar, 3 Tbsp sugar, ½ tsp vanilla, ¼ cup vegetable oil","Instructions":"0. Preheat oven to 350 degrees.Use a mixer to combine the pumpkin, eggs, vanilla, sugar, and oil. 1. Mix until combined and smooth.In a small bowl combine the flour, baking powder, salt, and spices with a whisk.With mixer on low, slowly add the flour to the pumpkin mixture. 2. Mix just until incorporated. Do not over-mix.Coat a doughnut pan with nonstick spray. Fill each well about  full. Use back of spoon or small spatula to smooth out batter. 3. Bake for 12-15 minutes. Use a toothpick to check for doneness. When it comes out clean they are ready.While doughnuts are cooking combine sugar and cinnamon in a small bowl, set aside. 4. Remove doughnuts from pan and gently toss in cinnamon sugar. Cool on wire rack.","Calories":"140","Carbs":"20g","Fat":"5g","Protein":"2g"},{"Meal":"tuesday 2","Name":"Spanish style salmon fillets","Ingredients":"2 cups croutons, ¾ cup pitted green olives, 3 red onions, cut into wedges, 3 red bell peppers, seeded and cut into thick strips, ½ tsp smoked paprika, 1 ½ tsp coarse sea salt, 1 ½ tsp ground black pepper, 5 Tbs olive oil, 1 pound salmon fillets","Instructions":"0. Cut onions into wedges and slice bell peppers into strips. 1. Put the croutons, olives, onions, and peppers on a baking sheet. 2. Add the smoked paprika, salt, pepper and 3 tablespoons of the olive oil and toss until everything is evenly coated. 3. Bake in the oven at 400F for about 15 minutes.Rub the salmon fillets with the remaining 2 tablespoons olive oil and season with the remaining salt and pepper. Arrange the fillets among the vegetables and croutons on the baking sheet. 4. Bake for 10-15 minutes or until the salmon is cooked.","Calories":"944","Carbs":"51g","Fat":"59g","Protein":"52g"},{"Meal":"tuesday 3","Name":"Nearly Famous Chicken Tortilla Soup","Ingredients":"2 tablespoons olive oil, 1 small onion, chopped, 2\/3 cup fresh cilantro, chopped, 3 cloves minced garlic, 14 ounces ½ cans diced tomatoes, 4 cups chicken broth, 3\/4 tablespoon cumin, 1\/2 tablespoon chili powder, 1\/4 teaspoon cayenne pepper, 2 bay leaves, 2 carrots, thinly sliced, 2 skinless chicken breasts, halved and thinly sliced, 3\/4 teaspoon salt, Pepper to taste, 1 cup shredded Monterey jack or cheddar cheese, 2 avocados, diced, Bag of tortilla chips","Instructions":"0. In a large stock pot, heat the oil over high. 1. Add onions, 1\/3 cup cilantro and garlic, saut 3 minutes. 2. Stir in tomatoes and spices, then bring to a boil. 3. Add the broth, carrots and chicken. Return to a boil, then reduce heat to medium and cook another 10-12 minutes. 4. Stir in half the cheese and 1 cup crushed tortilla chips. 5. Ladle into bowls and top with remaining cheese, fresh cilantro, fresh avocado, and more tortilla chip pieces. 6. Serves 4+. 7. This is a great recipe for leftover chicken or a rotisserie chicken.  Just add it in at the very end to warm it up!","Calories":"915","Carbs":"77g","Fat":"51g","Protein":"42g"},{"Meal":"wednesday 1","Name":"Scrambled tofu with rocket","Ingredients":"150 gm organic tofu, 1 tsp pure coconut oil, 1\/2 tsp cumin seeds, 1\/2 onion, finely chopped, 1 tomato, chopped, 1\/4 tsp turmeric, 1 red chilli, finely chopped (optional), Handful of rocket leaves, Salt and pepper, as per taste","Instructions":"0. Heat the coconut oil in a pan, on medium heat. 1. Add the cumin and let it sputter. 2. Add in the chopped onion and green chilli and cook for 5 minutes. 3. Add the tomatoes and cook for a further minute. 4. Add the turmeric powder and salt to taste, and stir well. Lightly crumble the tofu and and mix gently. Cook for 5 minutes. Toss in the rocket, mix and cook for a couple of minutes. Season with some pepper. 5. Serve the scrambled tofu with some grilled tomatoes, rocket leaves and vegan sausages.","Calories":"236","Carbs":"18g","Fat":"11g","Protein":"16g"},{"Meal":"wednesday 2","Name":"Spanish Sardines Pasta","Ingredients":"8 oz fettuccine, 3.75 oz can Spanish sardine fillets in oil (or regular sardine fillets in oil), 2 Tbsp extra-virgin olive oil, 1 small red onion, finely chopped, 2 cloves garlic, minced, 4 oz grape or cherry tomatoes, halved, 2 oz black olives, sliced, 2 oz green olives with pimiento, sliced, 2 tsp capers, 1 Tbsp lemon juice, 1\/2 tsp red pepper flakes, 1\/2 c reserved pasta water, Freshly ground black pepper, Grated Parmesan cheese, Parsley for garnish","Instructions":"0. Start by cooking the pasta as usual. Just before you drain it, reserve 1\/2 c of the pasta water and set aside. 1. While the fettuccine is cooking, heat olive oil in a pan over low heat. 2. Add onion and cook for 3 minutes or until it just starts to soften. 3. Then, add garlic and cook for an additional 1 minute. 4. Add tomatoes, olives, capers, lemon juice, pepper flakes, and sardines (including the oil) and cook for 4 minutes. When adding the sardines, lightly break up the fillets with a fork. 5. Next, add reserved pasta water and freshly ground black pepper to taste and cook for an additional 2 minutes. 6. Finally, add cooked fettuccine to the pan and toss in the sauce. 7. Garnish with freshly grated Parmesan cheese and parsley, and serve with a nice crusty bread. Enjoy!","Calories":"920","Carbs":"96g","Fat":"42g","Protein":"40g"},{"Meal":"wednesday 3","Name":"Macadamia Crusted Whitefish","Ingredients":"2 Eggs, 3 1\/4 cups All-Purpose Flour, 1 teaspoon of Lemon Pepper, 1 cup macadamia nuts, 2 tablespoons of Oil, 1\/2 cup of Panko, 1 pound tilapia","Instructions":"0. Grab three bowls and add your eggs, whisked up to one, your flour in the second, and the panko, macadamia nuts, and lemon pepper in the third.Dip your fish first into the flour, then the egg, and finally the macadamia mixture. 1. Heat up the oil in a large frying pan on high heat. When the oil is good and hot, add your fish into the pan.Cook it up for about 3 minutes on each side, until cooked through, and serve. If needed, switch out your oil about halfway through pan frying.","Calories":"843","Carbs":"88g","Fat":"37g","Protein":"39g"},{"Meal":"thursday 1","Name":"Latkes; Fried Vegetable Pancakes from Europe and the Middle East","Ingredients":"1 C of Yukon Gold or russet potatoes, skinned and coarse grated, ½ C of parsnips, skinned and coarse grated, ½ C of yams, skinned and coarse grated, 3 cloves of garlic, skinned and coarse grated, 1 egg, beaten, 1 oz white flour, salt and pepper to taste, ½ inch of ginger, skinned and coarse grated(optional for garlic flavoring), peanut or other high temperature cooking oil, applesauce and low fat sour cream for serving, ½ C of red or other onion, skinned and coarse grated","Instructions":"0. Skin the vegetables and in a standard food processor, grate them into a suitable bowl. 1. Take a handful of the grated vegetables and squeeze as much moisture from it as possible. Then place on a paper towel. Continue until you have squeezed out as much of the moisture as you can. 2. Clean and dry the original bowl and repeat the process of squeezing the vegetables dry but putting them in the bowl when finished. Then stir them to mix thoroughly. 3. In a separate bowl, beat the egg with the flour to form a sticky glue that will hold the latkes together. 4. Mix the sticky egg and flour with the vegetable mixture and form into flat pancakes about 3 to 4 inches in diameter then place on a cutting board. 5. Heat about 1\/8 inch of peanut oil in a 10 inch cast iron skillet over medium high heat until a drop of water sizzles upon contact. 6. Place three of the pancakes into the skillet, press down with a spatula to thin them and cook until the edges start to turn deep brown. Flip them over carefully and cook for 2 to 3 minutes more. 7. Remove from pan and place on paper towels to drain excess oil. 8. Repeat until all are cooked and drained then place in a 175-200*F warming oven until ready to be served.","Calories":"392","Carbs":"48g","Fat":"19g","Protein":"8g"},{"Meal":"thursday 2","Name":"Moroccan chickpea and lentil stew","Ingredients":"1 cup broccoli, 1 can chickpeas, rinsed and drained, 2 large carrots, chopped, 2 celery stalks, chopped ili 1\/3 cup chopped celery root, ½ cup cooked lentils, 1 cup couscous, Fresh cilantro, optional, ⅛ tsp ground cinnamon, 2 tsp ground cumin, ½ tsp ground turmeric, 1 Tbs lemon juice, 2 tsp olive oil, 2 tsp paprika, Salt and pepper, 2-3 Tbs tomato paste, 1 ½ cups water","Instructions":"0. Heat oil in large saucepan over medium-high heat, add onion and cook for about 3 minutes. 1. Add celery, carrot and broccoli to pan and saut for about 5 minutes. 2. Add in all seasonings and cook additional 1 minute. 3. Add water, tomato paste, chickpeas and lentils, bring to a boil. Cover, reduce heat to low and simmer for 20 minutes.Meanwhile, cook couscous in separate pan according to package directions. 4. Add cilantro and lemon juice to stew and serve over warm couscous.","Calories":"465","Carbs":"82g","Fat":"7g","Protein":"20g"},{"Meal":"thursday 3","Name":"Knishes - Potato Filling","Ingredients":"6 tablespoons Chicken fat or butter, 1 Egg, 1 cup Chopped onions, 1\/4 teaspoon pepper, 2 cups Mashed potatoes, 6 tablespoons Salt","Instructions":"0. Brown the onions in the fat or butter. Beat in the potatoes, egg, salt and pepper until fluffy. 1. Place on dough.","Calories":"1142","Carbs":"88g","Fat":"81g","Protein":"15g"},{"Meal":"friday 1","Name":"Salmon Frittata","Ingredients":"2 cans canned salmon, 1\/4 teaspoon Cayenne pepper, 1 teaspoon Dried basil, 12 Eggs, beaten, 10 ounces Frozen chopped spinach thawed and drained, 1 pint Nonfat cottage cheese, 2 cups Shredded Swiss cheese","Instructions":"0. Drain and flake salmon. Spray 9 x 13-inch baking pan with non-stick vegetable coating. 1. Combine flaked salmon with remaining ingredients and pour into prepared baking pan. 2. Bake at 375 F for 30 minutes, or until frittata is set.","Calories":"624","Carbs":"12g","Fat":"34g","Protein":"65g"},{"Meal":"friday 2","Name":"Fried Salmon Cakes","Ingredients":"6 teaspoons brie, 1 can canned salmon, 1 teaspoon chili powder, 2 cups cornmeal, 1 egg, 2 tablespoons flat leaf parsley, 1 tablespoon chopped garlic, 1\/2 cup Greek yogurt, 3 tablespoons green onion, 5 kalamata olives, 1 lemon, 2 tablespoons mayonnaise, Olive Oil, 1 cup panko, 1 teaspoon of paprika, Pepper, 1 1\/2 teaspoons salt","Instructions":"0. In a large bowl, mix the wild salmon (remove some of the bones if necessary), olives, garlic, green onion, parsley, egg white, panko, yogurt, mayonnaise, salt pepper, and chili powder and paprika powder. 1. Combine all ingredients until well mixed.Put a palm-sized amount of salmon in your hand and roll into a ball. 2. Place a teaspoon of the brie in the middle of the ball and cover with the salmon. Flatten the salmon into a about -1-inch patty. Dip in the egg and then the cornmeal. Make another 5 patties. 3. Heat oven to 350 degrees 4. Heat a saute pan until hot, on medium heat, and then add enough oil to cover coat the bottom of the pan. Brown the patties on each side for 2 minutes, or until brown. 5. Place the browned salmon cakes on a cookie sheet. Brown all the cakes. 6. Place all the cakes in the oven for 15 minutes. 7. Remove from heat, spritz on some lemon juice and serve with salad. Enjoy!","Calories":"692","Carbs":"78g","Fat":"31g","Protein":"26g"},{"Meal":"friday 3","Name":"Chestnut Pappardelle","Ingredients":"2 cups arugula, washed, 3\/4 cup roasted chestnuts (recipe to follow), chopped, a pinch of dried tarragon, 2 eggs, beaten, 1\/2 cup Extra Virgin Olive Oil, 1\/4 cup shaved\/grated parmesan cheese, 6 chinese black mushrooms, soaked for 20 minutes until soft, and sliced, Oil, to cook, 4 ounces pappardelle, Salt & pepper, to taste, 2 teaspoons soy sauce","Instructions":"0. Cut the shell with an X where the shell bulges outward. 1. Place the chestnuts in a dish and completely cover with water and soak for 20 minutes. 2. Place in a baking dish and roast at 400  for 20 to 25 minutes. 3. Remove from oven, peel, and chop!Bring water to a boil, season with salt, and boil the egg pasta for 6-8 min, until cooked. 4. Drain and toss with a little olive oil to prevent sticking. 5. Saute the sliced mushrooms in oil and a little bit of soy sauce until the aroma fills the air 6. Pour in the egg mixture and scramble everything up. 7. Add the chopped chestnuts and cook for another few minutes. Stir in the pasta and the remaining olive oil and mix until everything is well coated. 8. Add in half of the parmesan cheese, and sprinkle in tarragon and more salt &amp; pepper to season.Turn the heat on low, add in the arugula and toss some more, making sure the arugula does not actually cook and stays crisp.Scoop onto a plate, decorate with more parmesan flakes, and fill your tummy with Christmas!","Calories":"681","Carbs":"70g","Fat":"36g","Protein":"20g"},{"Meal":"saturday 1","Name":"Sweet Potato Hashbrown Breakfast Bake","Ingredients":"4 eggs, 4 cloves garlic, minced, ¼ Cup green onions, chopped, Kosher salt and fresh ground pepper, 4 tablespoons of Olive Oil, 1 red bell pepper, chopped, ½ red onion, chopped, ¼ Cup shredded sharp cheddar cheese (like an English Cheddar), 2 sweet potatoes, peeled and chopped into 1-inch cubes","Instructions":"0. Preheat oven to 35 1. Peel and chop sweet potatoes into 1 inch cubes. 2. Spread peeled\/cubed sweet potatoes out over a half sheet rimmed baking sheet. Coat with 2 tbs of olive oil and sprinkle of salt and pepper. 3. Bake for 30-35 minutes until fork tender and browned.Meanwhile, heat 2 tbs olive oil in a large skillet over medium-high heat. 4. Add the red onions, bell peppers, green onions and garlic and saute until tender and lightly golden  about 5-6 minutes. Season with salt and pepper to taste.Portion out sweet potato hashbrown cubes between ramekins. Make a nest indentation in the top of each ramekin filled with hashbrowns. 5. Sprinkle grated sharp cheddar over the top of each ramekin. Crack an egg over each nested out spot. 6. Bake at 425 for 5-6 minutes. If the hashbrowns have been refrigerated, bake until each yolk is set and white has turned white!","Calories":"332","Carbs":"27g","Fat":"20g","Protein":"9g"},{"Meal":"saturday 2","Name":"Broccolini Quinoa Pilaf","Ingredients":"1 bunch broccolini, trimmed, 1 garlic clove, minced, 1 tbsp olive oil, ½ cup onion, 1 cup quinoa, rinsed, 2 cups vegetable broth, 2 oz chopped walnuts","Instructions":"0. In a large pan with lid heat olive oil over medium high heat. 1. Add onions and cook for 1 minute. 2. Add garlic and cook until onions are translucent and garlic is fragrant. 3. Add quinoa to pan, stir to combine. Slowly add in broth and bring to a boil.Cover and reduce heat to low, cook for 15 minutes.In the last 2-3 minutes of cooking add in broccolini on top of the quinoa (do not stir) and cover.Uncover and toss broccolini and quinoa together.Season to taste with salt and pepper. 4. Add walnuts and serve hot.","Calories":"625","Carbs":"71g","Fat":"30g","Protein":"19g"},{"Meal":"saturday 3","Name":"Stir-Fried Shredded Chicken and Mushrooms With Balsamic","Ingredients":"200 grams Chicken breast, Salt and pepper to taste, 1 tablespoon Cornstarch, 150 grams Mushrooms, sliced, 3 tablespoons Olive oil, 1 Shallot, diced, 3 tablespoons Balsamic, 40 grams Butter, diced","Instructions":"0. Rinse and pat the chicken breast dry with kitchen paper. Shred the chicken thinly and place them in a bowl. Season the chicken with salt and pepper. 1. Sprinkle the shredded chicken with cornstarch. 2. Heat the oil in a skillet until hot. 3. Add in the shredded chicken and stir until the colour turned white. 4. Remove and drain.  Stir the diced shallot in the same skillet with the remaining oil until aromatic. 5. Add in sliced mushrooms and stir until tender. 6. Pour the balsamic over and return the shredded chicken to the skillet. Bring it to a simmer and season with salt and pepper to taste. 7. Add the diced butter into the sauce and stir to combine. 8. Remove and serve with pasta or rice.","Calories":"1042","Carbs":"37g","Fat":"80g","Protein":"48g"},{"Meal":"sunday 1","Name":"Sun-Dried Tomato and Leek Quiche","Ingredients":"Crust, 1 cup whole-wheat pastry flour, 1\/4 cup pine nuts, 1\/4 cup whole almonds, 1\/4 teaspoon baking powder, 1\/4 cup unsweetened almond milk, 2 Tbs. olive oil, 1\/4 teaspoon salt, 4 Tbs. olive oil, divided, 1 large leek, white and light green parts chopped (about 2 cups), 12 ounces extra-firm tofu, drained and cut into 1.5-inch cubes, 2 tablespoons fresh lemon juice, 2 teaspoons miso paste, 1 clove garlic, minced, 3\/4 teaspoon salt, 1 cup Panko breadcrumbs, 1 teaspoon Italian seasonings, 1\/4 cup chopped reconstituted sun-dried tomatoes, drained","Instructions":"0. Crust 1. Preheat oven to 350F. 2. Coat four 5-inch tart pans with cooking spray. 3. Pulse flour, pine nuts,almonds,baking powder 4. In food processor until finely ground. 5. Whisk together almond milk, oil and salt in bowl. 6. Stir in flour mixture. Press into pan. 7. Bake 5 minutes, then cool. 8. Filling 9. Heat 1 Tbs. oil in skillet over medium heat. 10. Add leeks, and saute' 8 minutes, or until softened. Set aside. 11. Bring large saucepan of water to a boil. 12. Add tofu, and simmer 5 minutes. 13. Drain and pat dry. 14. Whisk 3 Tbsp. oil, lemon juice, miso, garlic and salt in bowl. 15. Add tofu and blend with an immersion blender. 16. Stir in breadcrumbs,seasonings, sun-dried tomatoes and leeks. 17. Spoon filling into crust. 18. Bake 40 minutes, or until crust is browned. 19. Cool 5 minutes, then unmold.","Calories":"681","Carbs":"59g","Fat":"42g","Protein":"20g"},{"Meal":"sunday 2","Name":"Snappy Shrimp, Spicy Hot Pepper Flakes, and Garlic Breath","Ingredients":"6 oz spaghetti, 8 oz raw shrimp, peeled &amp; deveined, 3 Tbsp extra-virgin olive oil, 1 Tbsp garlic, finely minced, 1 tsp hot pepper flakes, Parsley, chopped, Parmesan cheese, grated, Salt, to taste","Instructions":"0. Cook spaghetti in salted water until al dente 1. Drain, save 2 Tbsp pasta water 2. Heat olive oil over medium heat in a pan and add shrimp 3. Cook shrimp for 3-4 minutes&nbsp;&nbsp; 4. Add hot pepper flakes and garlic for 2 minutes 5. Add pasta water to the pan and bring to a boil, reduce for 2 minutes 6. Add pasta to pan and toss in the sauce 7. Add parsley and Parmesan 8. Serve","Calories":"707","Carbs":"67g","Fat":"31g","Protein":"37g"},{"Meal":"sunday 3","Name":"Loaded Turkey Burgers","Ingredients":"1\/3 c. dry breadcrumbs (such as panko), 1\/4 t. garlic powder, 1\/4 t. ground black pepper, 6 hamburger buns, 1 T. ketchup, 1 1\/2 lb. (93% lean) ground turkey, 1\/4 t. onion powder, 1 roasted red pepper, chopped (fresh or jarred), 1\/2 t. salt, 3 oz. sharp cheddar cheese, cut into 1\/4-inch cubes, 3 drops of Tabasco, 6 slices center cut bacon, cooked crisp and crumbled, vegetable oil, 1 tablespoon Worcestershire sauce, 1 T. yellow mustard","Instructions":"0. Preheat oven to 375 degrees f. In a large bowl, mix together ground turkey, Worcestershire, mustard, ketchup, Tabasco, garlic &amp; onion powders, salt, pepper and breadcrumbs. 1. Add the roasted pepper, cheese and bacon, evenly mix. Form the meat mixture into 6, 3\/4-inch thick patties. 2. Heat about 2 teaspoons of oil in a 12-inch nonstick skillet over medium-high heat until the oil shimmers. 3. Add half the patties and cook until well browned on the first side, about 2-3 minutes, flip the patties and brown on the second side, 2-3 minutes more. 4. Transfer the patties to a large baking sheet. Wipe out the skillet and repeat this step with 2 more teaspoons of oil and the remaining patties. 5. Bake the turkey burgers until the internal temperature reaches reaches 165 degrees f. anywhere from 8-10 minutes.","Calories":"611","Carbs":"28g","Fat":"37g","Protein":"39g"}]